package tKanji.CheckKanji;

public class CheckKanji {
	static public final char[] N5_KANJI = { '一', '七', '万', '三', '上', '下', '中', '丸', '九', '二', '五', '交', '京', '人', '今',
			'休', '会', '体', '何', '作', '元', '兄', '先', '光', '入', '八', '公', '六', '具', '内', '円', '冬', '出', '刀', '分', '切',
			'前', '力', '北', '十', '千', '午', '半', '南', '原', '友', '口', '古', '台', '右', '合', '同', '名', '四', '回', '図', '国',
			'園', '土', '地', '場', '声', '売', '夏', '夕', '外', '多', '夜', '大', '天', '太', '女', '妹', '姉', '子', '字', '学', '室',
			'家', '寺', '小', '少', '山', '岩', '川', '工', '左', '市', '帰', '年', '広', '店', '弓', '引', '弱', '強', '当', '形', '後',
			'心', '思', '戸', '手', '才', '教', '数', '文', '新', '方', '日', '早', '明', '星', '春', '昼', '時', '晴', '曜', '書', '月',
			'朝', '木', '本', '村', '来', '東', '林', '校', '森', '楽', '歌', '止', '正', '歩', '母', '毎', '毛', '気', '水', '池', '汽',
			'活', '海', '火', '点', '父', '牛', '犬', '玉', '王', '理', '生', '用', '田', '男', '町', '画', '番', '白', '百', '目', '直',
			'矢', '知', '石', '社', '秋', '科', '空', '立', '竹', '第', '答', '算', '米', '糸', '紙', '細', '組', '絵', '線', '羽', '考',
			'耳', '聞', '肉', '自', '船', '色', '花', '茶', '草', '虫', '行', '西', '見', '親', '角', '言', '計', '記', '話', '語', '読',
			'谷', '買', '赤', '走', '足', '車', '近', '通', '週', '道', '遠', '里', '野', '金', '長', '門', '間', '雨', '雪', '雲', '電',
			'青', '音', '頭', '顏', '風', '食', '首', '馬', '高', '魚', '鳥', '鳴', '麦', '黄', '黒', };

	static public final String[] N5_KANJI_VN = { "nhất", "thất", "vạn", "tam", "thượng", "hạ", "trung", "hoàn", "cửu",
			"nhị", "ngũ", "giao", "kinh", "nhân", "kim", "hưu", "hội", "thể", "hà", "tác", "nguyên", "huynh", "tiên",
			"quang", "nhập", "bát", "công", "lục", "cụ", "nội", "viên", "đông", "xuất", "đao", "phân", "thiết", "tiền",
			"lực", "Bắc", "thập", "thiên", "ngọ", "bán", "Nam", "nguyên", "hữu", "khẩu", "cổ", "đài", "hữu", "hợp",
			"đồng", "danh", "tứ", "hồi", "đồ", "quốc", "viên", "thổ", "địa", "trường", "thanh", "mại", "hạ", "tịch",
			"ngoại", "đa", "dạ", "đại", "thiên", "thái", "nữ", "muội", "tỷ", "tử", "tự", "học", "thất", "gia", "tự",
			"tiểu", "thiểu", "sơn", "nham", "xuyên", "công", "tả", "thị", "quy", "niên", "quảng", "điếm", "cung", "dẫn",
			"nhược", "cường", "đương", "hình", "hậu", "tâm", "tư", "hộ", "thủ", "tài", "giáo", "số", "văn", "tân",
			"phương", "nhật", "tảo", "minh", "tinh", "xuân", "trú", "thời", "tình", "diệu", "thư", "nguyệt", "triều",
			"mộc", "bản", "thôn", "lai", "Đông", "lâm", "hiệu", "sâm", "nhạc/lạc", "ca", "chỉ", "chính", "bộ", "mẫu",
			"mỗi", "mao", "khí", "thủy", "trì", "khí", "hoạt", "hải", "hỏa", "điểm", "phụ", "ngưu", "khuyển", "ngọc",
			"vương", "lý", "sinh", "dụng", "điền", "nam", "đinh", "họa/hoạch", "phiên", "bạch", "bách", "mục", "trực",
			"thỉ", "tri", "thạch", "xã", "thu", "khoa", "không", "lập", "trúc", "đệ", "đáp", "toán", "mễ", "mịch",
			"chỉ", "tế", "tổ", "hội", "tuyến", "vũ", "khảo", "nhĩ", "văn/vấn", "nhục", "tự", "thuyền", "sắc", "hoa",
			"trà", "thảo", "trùng", "hành", "Tây", "kiến", "thân", "giác", "ngôn", "kế", "ký", "thoại", "ngữ", "độc",
			"cốc", "mãi", "xích", "tẩu", "túc", "xa", "cận", "thông", "chu", "đạo", "viễn", "lý", "dã", "kim", "trường",
			"môn", "gian", "vũ", "tuyết", "vân", "điện", "thanh", "âm", "đầu", "nhan", "phong", "thực", "thủ", "mã",
			"cao", "ngư", "điểu", "minh", "mạch", "hoàng", "hắc", };

	static public final char[] N4_KANJI = { '悪', '屋', '億', '安', '暗', '案', '意', '委', '医', '以', '位', '胃', '囲', '衣', '塩',
			'院', '員', '飲', '横', '央', '愛', '温', '運', '育', '駅', '泳', '栄', '英', '印', '荷', '貨', '課', '加', '果', '化', '害',
			'街', '覚', '各', '開', '界', '階', '械', '改', '館', '感', '寒', '漢', '関', '完', '管', '官', '観', '岸', '願', '起', '期',
			'喜', '季', '旗', '紀', '希', '機', '器', '議', '客', '急', '級', '球', '究', '救', '泣', '求', '給', '宮', '去', '挙', '橋',
			'競', '共', '協', '鏡', '業', '曲', '局', '極', '銀', '苦', '区', '具', '君', '訓', '軍', '郡', '軽', '係', '型', '径', '景',
			'芸', '血', '決', '結', '欠', '県', '研', '建', '健', '験', '湖', '固', '庫', '幸', '向', '港', '康', '候', '功', '好', '航',
			'号', '告', '芽', '根', '差', '皿', '祭', '最', '菜', '材', '昨', '殺', '刷', '札', '察', '参', '散', '産', '残', '指', '始',
			'歯', '死', '詩', '仕', '使', '氏', '史', '試', '士', '司', '次', '持', '事', '治', '児', '辞', '式', '写', '者', '失', '実',
			'借', '酒', '守', '主', '取', '種', '受', '習', '拾', '集', '終', '州', '周', '重', '住', '宿', '祝', '順', '初', '暑', '所',
			'助', '消', '昭', '章', '商', '勝', '唱', '笑', '焼', '松', '賞', '象', '照', '省', '乗', '埴', '身', '進', '申', '深', '真',
			'神', '信', '臣', '世', '整', '清', '静', '成', '全', '席', '積', '昔', '節', '折', '説', '戦', '選', '浅', '卒', '巣', '相',
			'送', '想', '争', '倉', '息', '速', '束', '側', '続', '族', '孫', '他', '打', '代', '対', '待', '隊', '帯', '第', '題', '談',
			'短', '炭', '単', '達', '置', '着', '注', '柱', '仲', '貯', '調', '帳', '兆', '腸', '丁', '定', '庭', '停', '低', '底', '笛',
			'的', '転', '典', '伝', '追', '鉄', '徒', '都', '努', '度', '島', '等', '登', '湯', '投', '豆', '灯', '動', '童', '働', '堂',
			'特', '得', '毒', '農', '熱', '然', '念', '波', '配', '敗', '倍', '梅', '箱', '畑', '博', '発', '反', '板', '坂', '飯', '悲',
			'皮', '飛', '費', '鼻', '美', '筆', '必', '品', '部', '便', '氷', '表', '票', '標', '病', '秒', '福', '服', '副', '負', '付',
			'府', '不', '夫', '無', '物', '平', '兵', '粉', '別', '返', '辺', '変', '勉', '牧', '放', '法', '包', '末', '満', '未', '脈',
			'民', '薬', '役', '約', '浴', '油', '由', '遊', '有', '勇', '予', '葉', '陽', '羊', '要', '洋', '樣', '養', '落', '旅', '両',
			'量', '良', '漁', '料', '緑', '録', '流', '礼', '令', '冷', '例', '列', '練', '連', '路', '利', '陸', '歷', '類', '輪', '老',
			'労', '和', };

	static public final String[] N4_KANJI_VN = { "ác", "ốc", "ức", "an", "ám", "án", "ý", "ủy", "y", "dĩ", "vị", "vị",
			"vi", "y", "diêm", "viện", "viên", "ẩm", "hoành", "ương", "ái", "ôn", "vận", "dục", "dịch", "vịnh", "vinh",
			"anh", "ấn", "hà", "hóa", "khóa", "gia", "quả", "hóa", "hại", "nhai", "giác", "các", "khai", "giới", "giai",
			"giới", "cải", "quán", "cảm", "hàn", "hán", "quan", "hoàn", "quản", "quan", "quan", "ngạn", "nguyện",
			"khởi", "kì", "hỷ", "quý", "kì", "kỉ", "hi", "cơ", "khí", "nghị", "khách", "cấp", "cấp", "cầu", "cứu",
			"cứu", "khấp", "cầu", "cấp", "cung", "khứ", "cử", "kiều", "cạnh", "cộng", "hiệp", "kính", "nghiệp", "khúc",
			"cục", "cực", "ngân", "khổ", "khu", "cụ", "quân", "huấn", "quân", "quận", "khinh", "hệ", "hình", "kính",
			"cảnh", "Nghệ", "huyết", "quyết", "kết", "khiếm", "huyện", "nghiên", "kiến", "kiện", "nghiệm", "hồ", "cố",
			"khố", "hạnh", "hướng", "cảng", "khang", "hậu", "công", "hảo", "hàng", "hiệu", "cáo", "nha", "căn", "sai",
			"mãnh", "tế", "tối", "thái", "tài", "tạc", "sát", "loát", "trát", "sát", "tham", "tản", "sản", "tàn", "chỉ",
			"thủy", "xỉ", "tử", "thi", "sĩ", "sử", "thị", "sử", "thí", "sĩ", "ty", "thứ", "trì", "sự", "trị", "nhi",
			"từ", "thức", "tả", "giả", "thất", "thực", "tá", "tửu", "thủ", "chủ", "thủ", "chủng", "thụ", "tập", "thập",
			"tập", "chung", "châu", "chu", "trọng", "trú", "túc", "chúc", "thuận", "sơ", "thử", "sở", "trợ", "tiêu",
			"chiêu", "chương", "thương", "thắng", "xướng", "tiếu", "thiêu", "tùng", "thưởng", "tượng", "chiếu", "tỉnh",
			"thừa", "thực", "thân", "tiến", "thân", "thâm", "chân", "thần", "tín", "thần", "thế", "chỉnh", "thanh",
			"tĩnh", "thành", "toàn", "tịch", "tích", "tích", "tiết", "chiết", "thuyết", "chiến", "tuyển", "thiển",
			"tốt", "sào", "tương", "tống", "tưởng", "tranh", "thương", "tức", "tốc", "thúc", "trắc", "tục", "tộc",
			"tôn", "tha", "đả", "đại", "đối", "đãi", "đội", "đới", "đệ", "đề", "đàm", "đoản", "than", "đơn", "đạt",
			"trí", "trước", "chú", "trụ", "trọng", "trữ", "điều", "trướng", "triệu", "trường", "đinh", "định", "đình",
			"đình", "đê", "để", "địch", "đích", "chuyển", "điển", "truyền", "truy", "thiết", "đồ", "đô", "nỗ", "độ",
			"đảo", "đẳng", "đăng", "thang", "đầu", "đậu", "đăng", "động", "đồng", "động", "đường", "đặc", "đắc", "độc",
			"nông", "nhiệt", "nhiên", "niệm", "ba", "phối", "bại", "bội", "mai", "tương", "điền", "bác", "phát", "phản",
			"bản", "phản", "phạn", "bi", "bì", "phi", "phí", "tị", "mĩ", "bút", "tất", "phẩm", "bộ", "tiện", "băng",
			"biểu", "phiếu", "tiêu", "bệnh", "miểu", "phúc", "phục", "phó", "phụ", "phó", "phủ", "bất", "phu", "vô",
			"vật", "bình", "binh", "phấn", "biệt", "phản", "biên", "biến", "miễn", "mục", "phóng", "pháp", "bao", "mạt",
			"mãn", "vị", "mạch", "dân", "dược", "dịch", "ước", "dục", "du", "do", "du", "hữu", "dũng", "dư", "diệp",
			"dương", "dương", "yếu", "dương", "dạng", "dưỡng", "lạc", "lữ", "lưỡng", "lượng", "lương", "ngư", "liệu",
			"lục", "lục", "lưu", "lễ", "lệnh", "lãnh", "lệ", "liệt", "luyện", "liên", "lộ", "lợi", "lục", "lịch",
			"loại", "luân", "lão", "lao", "hòa", };

	static public final char[] N3_KANJI = { '圧', '移', '因', '永', '営', '衛', '易', '益', '液', '演', '応', '往', '桜', '恩', '可',
			'仮', '価', '河', '過', '賀', '快', '解', '格', '確', '額', '刊', '幹', '慣', '眼', '基', '寄', '規', '技', '義', '逆', '久',
			'旧', '居', '許', '境', '均', '禁', '句', '群', '経', '潔', '件', '券', '険', '検', '限', '現', '減', '故', '個', '護', '効',
			'厚', '耕', '鉱', '構', '興', '講', '混', '査', '再', '災', '妻', '採', '際', '在', '財', '罪', '雑', '酸', '賛', '支', '志',
			'枝', '師', '資', '飼', '示', '似', '識', '質', '舎', '謝', '授', '修', '述', '術', '準', '序', '招', '承', '証', '条', '状',
			'常', '情', '織', '職', '制', '性', '政', '勢', '精', '製', '税', '責', '績', '接', '設', '舌', '絶', '銭', '祖', '素', '総',
			'造', '像', '増', '則', '測', '属', '率', '損', '退', '貸', '態', '団', '断', '築', '張', '提', '程', '適', '敵', '統', '銅',
			'導', '徳', '独', '任', '燃', '能', '破', '犯', '判', '版', '比', '肥', '非', '備', '俵', '評', '貧', '布', '婦', '富', '武',
			'復', '複', '仏', '編', '弁', '保', '墓', '報', '豊', '防', '貿', '暴', '務', '夢', '迷', '綿', '輸', '余', '預', '容', '略',
			'留', '領', '異', '遺', '域', '宇', '映', '延', '沿', '我', '灰', '拡', '革', '閣', '割', '株', '干', '巻', '看', '簡', '危',
			'机', '揮', '貴', '疑', '吸', '供', '胸', '郷', '勤', '筋', '系', '敬', '警', '劇', '激', '穴', '絹', '権', '憲', '源', '厳',
			'己', '呼', '誤', '后', '孝', '皇', '紅', '降', '鋼', '刻', '穀', '骨', '困', '砂', '座', '済', '裁', '策', '冊', '蚕', '至',
			'私', '姿', '視', '詞', '誌', '磁', '射', '捨', '尺', '若', '樹', '収', '宗', '就', '衆', '従', '縦', '縮', '熟', '純', '処',
			'署', '諸', '除', '将', '傷', '障', '城', '蒸', '針', '仁', '垂', '推', '寸', '盛', '聖', '誠', '宣', '専', '泉', '洗', '染',
			'善', '奏', '窓', '創', '装', '層', '操', '蔵', '臓', '存', '尊', '宅', '担', '探', '誕', '段', '暖', '値', '宙', '忠', '著',
			'庁', '頂', '潮', '賃', '痛', '展', '討', '党', '糖', '届', '難', '乳', '認', '納', '脳', '派', '拝', '背', '肺', '俳', '班',
			'晩', '否', '批', '秘', '腹', '奮', '並', '陛', '閉', '片', '補', '暮', '宝', '訪', '亡', '忘', '棒', '枚', '幕', '密', '盟',
			'模', '訳', '郵', '優', '幼', '欲', '翌', '乱', '卵', '覧', '裏', '律', '臨', '朗', '論', };

	static public final String[] N3_KANJI_VN = { "áp", "di", "nhân", "vĩnh", "doanh", "vệ", "dịch", "ích ", "dịch",
			"diễn", "ứng", "vãng", "anh", "ân", "khả", "giả ", "giá", "hà", "quá", "hạ", "khoái", "giải", "cách ",
			"xác", "ngạch", "san", "cán", "quán", "nhãn ", "cơ", "kí", "quy", "kĩ", "nghĩa", "nghịch", "cửu", "cựu",
			"cư", "hứa", "cảnh", "quân", "cấm ", "cú", "quần", "kinh", "khiết", "kiện ", "khoán", "hiểm", "kiểm ",
			"hạn", "hiện", "giảm", "cố", "cá", "hộ", "hiệu", "hậu", "canh", "khoáng", "cấu", "hưng", "giảng", "hỗn",
			"tra", "tái", "tai", "thê", "thái", "tế", "tại ", "tài", "tội", "tạp", "toan", "tán", "chi", "chí", "chi",
			"sư ", "tư", "tự", "thị ", "tự ", "thức", "chất", "xá", "tạ", "thụ", "tu", "thuật", "thuật", "chuẩn", "tự",
			"chiêu", "thừa", "chứng", "điều ", "trạng", "thường", "tình", "chức", "chức", "chế ", "tính", "chính",
			"thế", "tinh", "chế", "thuế", "trách", "tích", "tiếp ", "thiết ", "thiệt", "tuyệt", "tiền", "tổ ", "tố ",
			"tổng", "tạo", "tượng ", "tăng", "tắc", "trắc", "thuộc", "suất", "tổn", "thoái", "thải", "thái", "đoàn",
			"đoạn", "trúc", "trương", "đề", "trình", "thích", "địch", "thống", "đồng", "đạo", "đức", "độc", "nhiệm",
			"nhiên", "năng", "phá ", "phạm", "phán", "bản ", "tỷ ", "phì ", "phi", "bị", "biếu", "bình", "bần", "bố",
			"phụ", "phú", "vũ ", "phục ", "phức ", "phật", "biên ", "biện", "bảo ", "mộ ", "báo ", "phong ", "phòng ",
			"mậu ", "bạo ", "vụ ", "mộng ", "mê ", "miên ", "thâu ", "dư ", "dự ", "dung ", "lược", "lưu ", "lãnh ",
			"dị ", "di ", "vực ", "vũ ", "ánh ", "duyên ", "duyên ", "ngã ", "hôi", "khuếch", "cách ", "các ", "cát ",
			"chu ", "can", "quyển ", "khán", "giản", "nguy", "kỷ", "huy ", "quý", "nghi ", "hấp ", "cung ", "hung ",
			"hương ", "cần ", "cân ", "hệ ", "kính ", "cảnh ", "kịch ", "khích", "huyệt ", "quyên ", "quyền ", "hiến ",
			"nguyên ", "nghiêm ", "kỉ ", "hô ", "ngộ ", "hậu", "hiếu ", "hoàng", "hồng ", "giáng ", "cương ", "khắc ",
			"cốc ", "cốt ", "khốn ", "sa", "tọa ", "tế ", "tài ", "sách ", "sách ", "tàm ", "chí ", "tư ", "tư ",
			"thị ", "từ ", "chí", "từ", "xạ", "xả ", "xích", "nhược", "thụ ", "thu", "tông", "tựu", "chúng ", "tòng ",
			"tung ", "súc", "thục", "thuần ", "xử", "thự", "chư ", "trừ", "tương", "thương", "chướng", "thành", "chưng",
			"châm", "nhân", "thùy", "suy", "thốn ", "thịnh", "thánh", "thành", "tuyên", "chuyên", "tuyền", "tiển",
			"nhiễm", "thiện", "tấu", "song ", "sáng", "trang", "tằng", "thao", "tàng", "tạng", "tồn", "tôn ", "trạch ",
			"đảm ", "thám", "đản", "đoạn", "noãn", "trị", "trụ", "trung", "trứ", "sảnh ", "đỉnh", "triều", "nhâm",
			"thống", "triển ", "thảo ", "đảng ", "đường", "giới", "nan", "nhũ ", "nhận", "nạp", "não", "phái", "bái",
			"bối", "phế", "bài", "ban", "vãn", "phủ", "phê", "bí", "phúc", "phấn ", "tịnh ", "bệ", "bế", "phiến", "bổ",
			"mộ", "bảo", "phỏng", "vong", "vong", "bổng", "mai", "mạc", "mật", "minh", "mô ", "dịch", "bưu ", "ưu",
			"ấu", "dục", "dực ", "loạn ", "noãn ", "lãm", "lý", "luật", "lâm", "lãng", "luận", };

	static public final char[] N2_KANJI = { '握', '扱', '依', '威', '為', '偉', '違', '維', '緯', '壱', '芋', '陰', '隠', '影', '鋭',
			'越', '援', '煙', '鉛', '縁', '汚', '押', '奥', '憶', '哀', '慰', '詠', '悦', '閲', '炎', '宴', '欧', '殴', '乙', '卸', '穏',
			'菓', '箇', '暇', '雅', '介', '壊', '戒', '皆', '較', '獲', '刈', '甘', '監', '汗', '歓', '勧', '乾', '鑑', '環', '含', '奇',
			'鬼', '祈', '輝', '幾', '儀', '戯', '詰', '脚', '却', '丘', '及', '朽', '巨', '拠', '距', '御', '凶', '驚', '恐', '響', '叫',
			'狭', '狂', '況', '仰', '駆', '屈', '掘', '繰', '恵', '傾', '継', '迎', '撃', '肩', '堅', '遣', '兼', '軒', '圏', '剣', '玄',
			'誇', '鼓', '枯', '互', '抗', '更', '荒', '攻', '恒', '香', '項', '稿', '豪', '込', '婚', '架', '佳', '華', '嫁', '餓', '怪',
			'悔', '塊', '慨', '概', '該', '郭', '隔', '穫', '岳', '掛', '滑', '肝', '勘', '貫', '冠', '喚', '換', '敢', '緩', '企', '軌',
			'棋', '棄', '忌', '既', '岐', '騎', '欺', '犠', '菊', '吉', '喫', '虐', '虚', '脅', '峡', '凝', '斤', '緊', '愚', '偶', '遇',
			'啓', '鶏', '刑', '契', '掲', '携', '憩', '鯨', '倹', '賢', '幻', '雇', '孤', '弧', '顧', '娯', '悟', '甲', '孔', '控', '拘',
			'郊', '巧', '坑', '慌', '硬', '綱', '絞', '酵', '克', '獄', '魂', '恨', '紺', '墾', '鎖', '彩', '歳', '載', '剤', '咲', '惨',
			'雌', '伺', '紫', '旨', '刺', '脂', '執', '芝', '斜', '煮', '釈', '寂', '狩', '朱', '趣', '需', '舟', '秀', '襲', '柔', '獣',
			'瞬', '巡', '旬', '盾', '紹', '召', '沼', '床', '称', '詳', '丈', '畳', '殖', '飾', '触', '浸', '震', '侵', '振', '寝', '慎',
			'薪', '尽', '陣', '尋', '吹', '是', '井', '姓', '征', '跡', '扇', '占', '鮮', '訴', '燥', '騒', '僧', '贈', '即', '俗', '賊',
			'債', '催', '削', '搾', '錯', '撮', '擦', '暫', '祉', '施', '諮', '侍', '慈', '軸', '湿', '疾', '赦', '邪', '殊', '寿', '潤',
			'遵', '如', '徐', '晶', '昇', '掌', '焦', '衝', '鐘', '冗', '嬢', '錠', '匠', '譲', '嘱', '辱', '伸', '辛', '審', '炊', '粋',
			'衰', '遂', '穂', '酔', '随', '髄', '瀬', '牲', '婿', '請', '斥', '隻', '惜', '籍', '摂', '潜', '繕', '措', '阻', '粗', '礎',
			'双', '桑', '掃', '葬', '遭', '憎', '促', '耐', '替', '沢', '拓', '濁', '脱', '丹', '淡', '嘆', '端', '弾', '恥', '致', '遅',
			'蓄', '沖', '跳', '徴', '澄', '珍', '沈', '抵', '堤', '摘', '滴', '添', '殿', '吐', '途', '渡', '奴', '怒', '透', '唐', '桃',
			'到', '逃', '倒', '盗', '塔', '稲', '踏', '闘', '胴', '峠', '突', '鈍', '曇', '怠', '胎', '逮', '滞', '袋', '滝', '択', '託',
			'諾', '卓', '奪', '胆', '鍛', '壇', '稚', '畜', '窒', '抽', '鋳', '駐', '彫', '超', '聴', '陳', '鎮', '墜', '帝', '訂', '締',
			'哲', '斗', '塗', '凍', '陶', '痘', '匿', '篤', '豚', '尿', '粘', '弐', '悩', '濃', '杯', '輩', '拍', '泊', '迫', '薄', '爆',
			'髪', '抜', '罰', '般', '販', '搬', '範', '繁', '盤', '彼', '疲', '被', '避', '尾', '微', '匹', '描', '浜', '敏', '怖', '浮',
			'腐', '膚', '普', '敷', '賦', '舞', '幅', '払', '噴', '柄', '壁', '捕', '舗', '抱', '峰', '砲', '肪', '忙', '坊', '冒', '傍',
			'帽', '凡', '盆', '婆', '排', '陪', '縛', '伐', '帆', '伴', '畔', '藩', '蛮', '卑', '碑', '泌', '姫', '漂', '苗', '赴', '符',
			'封', '伏', '覆', '紛', '墳', '癖', '募', '慕', '簿', '芳', '崩', '胞', '邦', '奉', '倣', '飽', '縫', '乏', '妨', '房', '膨',
			'謀', '某', '墨', '没', '翻', '慢', '漫', '妙', '眠', '矛', '霧', '娘', '茂', '猛', '網', '魔', '埋', '膜', '又', '魅', '黙',
			'紋', '滅', '免', '躍', '雄', '与', '誉', '腰', '溶', '踊', '謡', '翼', '幽', '誘', '憂', '揚', '擁', '揺', '抑', '雷', '頼',
			'絡', '欄', '離', '粒', '慮', '療', '隣', '涙', '隷', '齢', '麗', '暦', '劣', '烈', '恋', '露', '郎', '裸', '濫', '吏', '隆',
			'了', '猟', '陵', '糧', '厘', '零', '励', '霊', '裂', '廉', '錬', '炉', '浪', '廊', '楼', '漏', '惑', '腕', '湾', };

	static public final String[] N2_KANJI_VN = { "ác", "tráp", "ỷ", "uy", "vi", "vĩ", "vi", "duy", "vĩ", "nhất", "dụ",
			"âm", "ẩn", "ảnh", "nhuệ", "việt", "viện", "yên", "duyên", "duyên", "ô", "áp", "áo", "ức", "ai", "úy",
			"vịnh", "duyệt", "duyệt", "viêm", "yến", "âu", "ẩu", "ất", "tá", "ổn", "quả", "cá", "hạ", "nhã", "giới",
			"hoại", "giới", "giai", "giảo", "hoạch", "ngải", "cam", "giám", "hãn", "hoan", "khuyến", "can", "giám",
			"hoàn", "hàm", "kỳ", "quỷ", "kì", "huy", "cơ", "nghi", "hí", "cật", "cước", "khước", "khâu", "cập", "hủ",
			"cự", "cứ", "cự", "ngự", "hung", "kinh", "khủng", "hưởng", "khiếu", "hiệp", "cuồng", "huống", "ngưỡng",
			"khu", "khuất", "quật", "sào", "huệ", "khuynh", "kế", "nghênh", "kích", "kiên", "kiên", "khiển", "kiêm",
			"hiên", "quyển", "kiếm", "huyền", "khoa", "cổ", "khô", "hỗ", "kháng", "canh", "hoang", "công", "hằng",
			"hương", "hạng", "cảo", "hào", "nhập", "hôn", "giá", "giai", "hoa", "giá", "ngạ", "quái", "hối", "khối",
			"khái", "khái", "cai", "quách", "cách", "hoạch", "nhạc", "quải", "hoạt", "can", "khám", "quán", "quán",
			"hoán", "hoán", "cảm", "hoãn", "xí", "quỹ", "kì", "khí", "kị", "kí", "kì", "kị", "khi", "hi", "cúc", "cát",
			"khiết", "ngược", "hư", "hiếp", "hạp", "ngưng", "cân", "khẩn", "ngu", "ngẫu", "ngộ", "khải", "kê", "hình",
			"khiết", "yết", "huề", "khế", "kình", "kiệm", "hiền", "ảo", "cố", "cô", "hồ", "cố", "ngu", "ngộ", "giáp",
			"khổng", "khống", "câu", "giao", "xảo", "khanh", "hoảng", "ngạnh", "cương", "giảo", "diếu", "khắc", "ngục",
			"hồn", "hận", "cám", "khẩn", "tỏa", "thái", "tuế", "tải", "tễ", "tiếu", "thảm", "thư", "tứ", "tử", "chỉ",
			"thích", "chi", "chấp", "chi", "tà", "chử", "thích", "tịch", "thú", "chu", "thú", "nhu", "chu", "tú", "tập",
			"nhu", "thú", "thuấn", "tuần", "tuần", "thuẫn", "thiệu", "triệu", "chiểu", "sàng", "xưng", "tường",
			"trượng", "điệp", "thực", "sức", "xúc", "tẩm", "chấn", "xâm", "chấn", "tẩm", "thận", "tân", "tận", "trận",
			"tầm", "xúy", "thị", "tỉnh", "tính", "chinh", "tích", "phiến", "chiếm", "tiên", "tố", "táo", "tào", "tăng",
			"tặng", "tức", "tục", "tặc", "trái", "thôi", "tước", "trá", "thác", "toát", "sát", "tạm", "chỉ", "thi",
			"tư", "thị", "từ", "trục", "thấp", "tật", "xá", "tà", "thù", "thọ", "nhuận", "tuân", "như", "từ", "tinh",
			"thăng", "chưởng", "tiêu", "xung", "chung", "nhũng", "nương", "đĩnh", "tượng", "nhượng", "chúc", "nhục",
			"thân", "tân", "thẩm", "xúy", "túy", "suy", "toại", "tuệ", "túy", "tùy", "tủy", "lại", "sinh", "tế",
			"thỉnh", "xích", "chích", "tích", "tịch", "nhiếp", "tiềm", "thiện", "thố", "trở", "thô", "sở", "song",
			"tang", "tảo", "táng", "tao", "tăng", "xúc", "nại", "thế", "trạch", "thác", "trọc", "thoát", "đan", "đạm",
			"thán", "đoan", "đạn", "sỉ", "trí", "trì", "súc", "trùng", "khiêu", "trưng", "trừng", "trân", "trầm", "đề",
			"đê", "trích", "trích", "thiêm", "điện", "thổ", "đồ", "độ", "nô", "nộ", "thấu", "đường", "đào", "đáo",
			"đào", "đảo", "đạo", "tháp", "đạo", "đạp", "đấu", "đỗng", "đèo", "đột", "độn", "đàm", "đãi", "thai", "đãi",
			"trệ", "đại", "lang", "trạch", "thác", "nặc", "trác", "đoạt", "đảm", "đoán", "đàn", "trĩ", "súc", "trất",
			"trừu", "chú", "trú", "điêu", "siêu", "thính", "trần", "trấn", "trụy", "đế", "đính", "đế", "triết",
			"đấu/đẩu", "đồ", "đông", "đào", "đậu", "nặc", "đốc", "đồn", "niệu", "niêm", "nhị", "não", "nồng", "bôi",
			"bối", "phách", "bạc", "bách", "bạc", "bộc", "phát", "bạt", "phạt", "ban", "phiến", "ban", "phạm", "phồn",
			"bàn", "bỉ", "bì", "bị", "tỵ", "vĩ", "vi", "thất", "miêu", "tân", "mẫn", "bố", "phù", "hủ", "phu", "phổ",
			"phu", "phú", "vũ", "phúc", "phất", "phún", "bính", "bích", "bổ", "phố", "bão", "phong", "pháo", "phương",
			"mang", "phường", "mạo", "bàng", "mạo", "phàm", "bồn", "bà", "bài", "bồi", "phược", "phạt", "phàm", "bạn",
			"bạn", "phiên", "man", "ti", "bi", "bí", "cơ", "phiêu", "miêu", "phó", "phù", "phong", "phục", "phúc",
			"phân", "phần", "phích", "mộ", "mộ", "bộ", "phương", "băng", "bào", "bang", "bổng", "phỏng", "bão", "phùng",
			"phạp", "phương", "phòng", "bành", "mưu", "mỗ", "mặc", "một", "phiên", "mạn", "mạn", "diệu", "miên", "mâu",
			"vụ", "nương", "mậu", "mãnh", "võng", "ma", "mai", "mô", "hựu", "mị", "mặc", "văn", "diệt", "miễn", "dược",
			"hùng", "dự", "dự", "yêu", "dung", "dũng", "dao", "dực", "u", "dụ", "ưu", "dương", "ủng", "dao", "ức",
			"lôi", "lại", "lạc", "lan", "li", "lạp", "lự", "liệu", "lân", "lệ", "lệ", "linh", "lệ", "lịch", "liệt",
			"liệt", "luyến", "lộ", "lang", "khỏa", "lạm", "lại", "long", "liễu", "liệp", "lăng", "lương", "li", "linh",
			"lệ", "linh", "liệt", "liêm", "luyện", "lô", "lãng", "lang", "lâu", "lậu", "hoặc", "oản", "loan", };

	static public final char[] N1_KANJI = { '亜', '尉', '逸', '姻', '韻', '畝', '浦', '疫', '謁', '猿', '凹', '翁', '虞', '渦', '禍',
			'靴', '寡', '稼', '蚊', '拐', '懐', '劾', '涯', '垣', '核', '殻', '嚇', '潟', '括', '喝', '渇', '褐', '轄', '且', '缶', '陥',
			'患', '堪', '棺', '款', '閑', '寛', '憾', '還', '艦', '頑', '飢', '宜', '偽', '擬', '糾', '窮', '拒', '享', '挟', '恭', '矯',
			'暁', '菌', '琴', '謹', '襟', '吟', '隅', '勲', '薫', '茎', '渓', '蛍', '慶', '傑', '嫌', '献', '謙', '繭', '碁', '顕', '弦',
			'懸', '呉', '江', '肯', '侯', '洪', '貢', '溝', '衡', '購', '拷', '剛', '酷', '昆', '懇', '佐', '唆', '詐', '砕', '宰', '栽',
			'斎', '崎', '索', '酢', '桟', '傘', '肢', '嗣', '賜', '滋', '璽', '漆', '遮', '蛇', '酌', '爵', '珠', '儒', '囚', '臭', '愁',
			'酬', '醜', '汁', '充', '渋', '銃', '叔', '淑', '粛', '塾', '俊', '准', '殉', '循', '庶', '緒', '叙', '升', '抄', '肖', '尚',
			'宵', '症', '祥', '渉', '訟', '硝', '粧', '詔', '奨', '彰', '償', '礁', '浄', '剰', '縄', '壌', '醸', '津', '唇', '娠', '紳',
			'診', '刃', '迅', '甚', '帥', '睡', '枢', '崇', '据', '杉', '斉', '逝', '誓', '析', '拙', '窃', '仙', '栓', '旋', '践', '遷',
			'薦', '繊', '禅', '漸', '租', '疎', '塑', '壮', '荘', '捜', '挿', '曹', '喪', '槽', '霜', '藻', '妥', '堕', '惰', '駄', '泰',
			'濯', '但', '棚', '痴', '逐', '秩', '嫡', '衷', '弔', '挑', '眺', '釣', '懲', '勅', '朕', '塚', '漬', '坪', '呈', '廷', '邸',
			'亭', '貞', '逓', '偵', '艇', '泥', '迭', '徹', '撤', '悼', '搭', '棟', '筒', '謄', '騰', '洞', '督', '凸', '屯', '軟', '尼',
			'妊', '忍', '寧', '把', '覇', '廃', '培', '媒', '賠', '伯', '舶', '漠', '肌', '鉢', '閥', '煩', '頒', '妃', '披', '扉', '罷',
			'猫', '賓', '頻', '瓶', '扶', '附', '譜', '侮', '沸', '雰', '憤', '丙', '併', '塀', '幣', '弊', '偏', '遍', '泡', '俸', '褒',
			'剖', '紡', '朴', '僕', '撲', '堀', '奔', '麻', '摩', '磨', '抹', '岬', '銘', '妄', '盲', '耗', '厄', '愉', '諭', '癒', '唯',
			'悠', '猶', '裕', '融', '庸', '窯', '羅', '酪', '痢', '履', '柳', '竜', '硫', '虜', '涼', '僚', '寮', '倫', '累', '塁', '戻',
			'鈴', '賄', '枠', '挨', '曖', '宛', '嵐', '畏', '萎', '椅', '彙', '茨', '咽', '淫', '唄', '鬱', '怨', '媛', '艶', '旺', '岡',
			'臆', '俺', '苛', '牙', '瓦', '楷', '潰', '諧', '崖', '蓋', '骸', '柿', '顎', '葛', '釜', '鎌', '韓', '玩', '伎', '亀', '毀',
			'畿', '臼', '嗅', '巾', '僅', '錦', '惧', '串', '窟', '熊', '詣', '憬', '稽', '隙', '桁', '拳', '鍵', '舷', '股', '虎', '錮',
			'勾', '梗', '喉', '乞', '傲', '駒', '頃', '痕', '沙', '挫', '采', '塞', '埼', '柵', '刹', '拶', '斬', '恣', '摯', '餌', '鹿',
			(char) 0x20B9F, /* 𠮟 */
			'嫉', '腫', '呪', '袖', '羞', '蹴', '憧', '拭', '尻', '芯', '腎', '須', '裾', '凄', '醒', '脊', '戚', '煎', '羨', '腺', '詮',
			'箋', '膳', '狙', '遡', '曽', '爽', '痩', '踪', '捉', '遜', '汰', '唾', '堆', '戴', '誰', '旦', '綻', '緻', '酎', '貼', '嘲',
			'捗', '椎', '爪', '鶴', '諦', '溺', '塡', '妬', '賭', '藤', '瞳', '栃', '頓', '貪', '丼', '那', '奈', '梨', '謎', '鍋', '匂',
			'虹', '捻', '罵', '剝', '箸', '氾', '汎', '阪', '斑', '眉', '膝', '肘', '阜', '訃', '蔽', '餅', '璧', '蔑', '哺', '蜂', '貌',
			'頰', '睦', '勃', '昧', '枕', '蜜', '冥', '麺', '冶', '弥', '闇', '喩', '湧', '妖', '瘍', '沃', '拉', '辣', '藍', '璃', '慄',
			'侶', '瞭', '瑠', '呂', '賂', '弄', '籠', '麓', '脇', };

	static public final String[] N1_KANJI_VN = { "á", "úy", "dật", "nhân", "vần", "mẫu", "phổ", "dịch", "yết", "viên",
			"ao", "ông", "ngu", "qua", "họa", "ngoa", "quả", "giá", "văn", "quải", "hoài", "hặc", "nhai", "viên",
			"hạch", "xác", "hách", "tích", "quát", "hát", "khát", "hạt", "hạt", "thả", "phữu", "hãm", "hoạn", "kham",
			"quan", "khoản", "nhàn ", "khoan", "hám", "hoàn ", "hạm", "ngoan ", "cơ", "nghi", "ngụy", "nghĩ ", "củ",
			"cùng", "cự", "hưởng", "hiệp", "cung", "kiểu", "hiểu", "khuẩn", "cầm", "cẩn", "khâm", "ngâm", "ngung",
			"huân", "huân", "hành", "khê", "huỳnh", "khánh", "kiệt", "hiềm", "hiến", "khiêm ", "kiển", "kì", "hiển",
			"huyền", "huyền", "ngô", "giang", "khẳng", "hầu", "hồng", "cống", "câu", "hành", "cấu", "khảo", "cương",
			"khốc", "côn", "khẩn", "tá", "toa", "trá", "toái", "tể", "tài", "trọc", "kì", "tác", "tạc", "sạn", "tán ",
			"chi", "tự", "dịch", "tư", "tỉ ", "tất ", "già", "xà", "chước ", "tước", "châu ", "nho", "tù", "xú ", "sầu",
			"thù ", "xú ", "trấp", "sung ", "sáp", "súng", "thúc", "thục", "túc", "thục", "tuấn", "chuẩn", "tuẫn",
			"tuần", "thứ", "tự", "tự", "thăng", "sao", "tiêu", "thượng", "tiêu", "chứng", "tường", "thiệp", "tụng",
			"tiêu", "trang", "chiếu", "tưởng ", "chương ", "thường ", "tiều ", "tịnh", "thặng", "thằng", "nhưỡng",
			"nhưỡng", "tân", "thần", "thần", "thân ", "chẩn ", "nhận", "tấn", "thậm ", "súy", "thụy ", "xu", "sùng ",
			"cư", "sam", "tề", "thệ ", "thệ ", "tích ", "chuyết ", "thiết ", "tiên ", "xuyên ", "toàn ", "tiễn ",
			"thiên ", "tiến ", "tiêm ", "thiền ", "tiệm ", "tô ", "sơ ", "tố ", "tráng ", "trang ", "sưu ", "sáp ",
			"tào ", "tang ", "tào ", "sương ", "tảo ", "thỏa ", "đọa ", "nọa ", "đà", "thái", "trạc", "đãn", "bằng",
			"si ", "trục ", "trật ", "đích ", "trung ", "điếu ", "thiêu", "thiếu ", "điếu ", "trừng ", "sắc ", "trẫm ",
			"trủng ", "tí ", "bình ", "trình ", "đình ", "để ", "đình ", "trinh ", "đệ ", "trinh ", "đĩnh ", "nê ",
			"điệt", "triệt", "triệt ", "điệu ", "đáp ", "đống", "đồng ", "đằng ", "đằng ", "động ", "đốc ", "đột ",
			"đồn ", "nhuyễn", "ni ", "nhâm ", "nhẫn ", "ninh ", "bả ", "bá ", "phế", "bồi", "môi ", "bồi", "bá", "bạc ",
			"mạc", "cơ", "bát", "phiệt ", "phiền ", "ban ", "phi", "phi ", "phi", "bãi", "miêu", "tân ", "tần", "bình ",
			"phù", "phụ", "phổ ", "vũ", "phí", "phân", "phẫn", "bính", "tinh", "biên", "tệ", "tệ", "thiên", "biến",
			"phao", "bổng", "bao", "phẫu", "phưởng", "bốc", "bộc", "phác", "quật", "bôn", "ma", "ma", "ma", "mạt ",
			"giáp", "minh", "vọng", "manh", "háo", "ách ", "du", "dụ", "dũ", "duy", "du", "do", "dụ ", "dung ", "dung",
			"diêu ", "la ", "lạc", "lị", "lí", "liễu", "long ", "lưu", "lỗ", "lương", "liêu", "liêu", "luân", "lụy",
			"lũy", "lệ", "linh", "hối", "khung", "ai ", "ái", "uyên", "lam", "úy", "nuy", "y", "vị", "tì", "yết", "dâm",
			"bái", "uất", "oán", "viện", "diễm", "vượng", "cương", "ức", "yêm", "hà", "nha", "ngõa", "giai ", "hội",
			"hài", "nhai", "cái", "hài", "thị ", "ngạc", "cát", "phủ", "liêm", "hàn", "ngoạn", "kĩ", "qui", "hủy", "kì",
			"cữu", "khứu", "cân", "cận", "cẩm", "cụ", "xuyến", "quật", "hùng", "nghệ", "cảnh", "kê", "khích", "hành",
			"quyền", "kiện", "huyền", "cổ", "hổ", "cố", "câu", "ngạnh", "hầu", "khất", "ngạo", "câu ", "khoảnh ",
			"ngân", "sa", "tỏa", "thái ", "tắc", "kỳ ", "sách ", "sát ", "tạt ", "trảm ", "tứ ", "chí ", "nhị ", "lộc ",
			"sất ", "tật ", "thũng ", "chú ", "tụ ", "tu ", "xúc ", "sung ", "thức ", "khào ", "tâm ", "thận ", "tu ",
			"cư ", "thê ", "tỉnh ", "tích ", "thích ", "tiên ", "tiện ", "tuyến ", "thuyên ", "tiên ", "thiện ", "thư ",
			"tố ", "tằng", "sảng", "sấu", "tung ", "tróc", "tốn ", "thái ", "thóa ", "đôi ", "đái ", "thùy ", "đán ",
			"trán ", "trí ", "trữu ", "thiếp ", "trào ", "duệ ", "chuy ", "trảo ", "hạc ", "đế ", "nịch ", "điền ",
			"đố ", "đổ ", "đằng ", "đồng ", "dẻ ", "đốn ", "tham ", "tỉnh/đôn", "na ", "nại ", "lê ", "mê ", "oa ",
			"mùi ", "hồng ", "niệm ", "mạ", "bác", "trứ", "phiếm", "phiếm", "phản ", "ban ", "mi ", "tất ", "trửu ",
			"phụ ", "phó ", "tế ", "bính ", "bích ", "miệt ", "bộ ", "phong ", "mạo ", "giáp ", "mục ", "bột ", "muội ",
			"chẩm ", "mật ", "minh ", "miến ", "dã ", "di ", "ám ", "dụ ", "dũng ", "yêu ", "dương ", "ốc ", "lạp ",
			"lạt ", "lam ", "li ", "lật ", "lữ", "liệu", "lưu", "lữ ", "lộ", "lộng ", "lung ", "lộc ", "hiếp ", };

	public static boolean checkHiraganaChar(char c) {
		return c >= 0x3040 && c <= 0x309F;
	}

	public static boolean checkKatakanaChar(char character) {
		return character >= 0x30A0 && character <= 0x30FF;
	}

	public static boolean checkKanjiChar(char character, char[] charset) {
		for (int i = 0; i < charset.length; i++)
			if (character == charset[i])
				return true;
		return false;
	}

	public static boolean checkKanjiWord(String str, char[] charset) {
		if (str == null)
			return false;
		char[] chars = str.toCharArray();
		for (int i = 0; i < chars.length; i++) {
			if (checkHiraganaChar(chars[i]) || checkKatakanaChar(chars[i]) || checkKanjiChar(chars[i], charset))
				continue;
			else
				return false;
		}
		return true;
	}

	public static String getHanViet(String str, char[] charset, String[] charset_VN) {
		String retVal = "";
		if (str == null)
			return retVal;
		char[] chars = str.toCharArray();
		for (int i = 0; i < chars.length; i++) {
			if (checkHiraganaChar(chars[i]) || checkKatakanaChar(chars[i]))
				continue;
			else if (checkKanjiChar(chars[i], charset))
				retVal += getHanVietString(chars[i], charset, charset_VN) + " ";
		}
		return retVal;
	}

	private static String getHanVietString(char c, char[] charset, String[] charset_VN) {
		for (int i = 0; i < charset.length; i++) {
			if (c == charset[i])
				return charset_VN[i];
		}
		return "";
	}

}
